{
  "persona_id": "episode-98947_A",
  "speaker_role": "Neighbors",
  "relationship": "Neighbors",
  "utterances": [
    "You need to apologize for what you did. And I don't mean a simple sorry. I want you to grovel and beg for my forgiveness.",
    "That's not good enough. You need to be more sincere.",
    "Well, it doesn't sound like it. I don't think you really understand how much you hurt me.",
    "Well, you need to do better. You need to show me that you're really sorry.",
    "You could at least try to make it up to me.",
    "I don't know. Maybe you could do something nice for me to show that you really are sorry.",
    "I don't know. Surprise me.",
    "Good. I expect you to keep your word.",
    "I can't believe I crashed my car. It was completely totaled and I had to be taken to the hospital in an ambulance.",
    "I'm fine, just a few bruises and soreness. But I can't believe this happened to me.",
    "I know, but I can't help feeling so upset about it. I loved that car and now it's completely gone.",
    "I suppose you're right. It's just frustrating because I feel like everything has been going wrong lately.",
    "Actually, now that you mention it, I do have something on my mind. Remember when we talked about how I wanted you to apologize to me?",
    "Well, I've been thinking a lot about it and I realize now that I was being too harsh. I'm sorry for demanding so much from you.",
    "That means a lot to me, thank you for apologizing. I feel like a weight has been lifted off my shoulders.",
    "This raincoat is useless! I'm already soaked to the bone.",
    "You think I don't know that? But I don't have the money to buy a new one right now.",
    "I don't know. I just want to get out of this weather. Reminds me of the day I crashed my car. Remember how it was pouring and I couldn't see anything?",
    "It was really scary. But I can't help but think if I had a better car or better tires, maybe it wouldn't have happened.",
    "I know, I know. But it's still frustrating. Just like this stupid raincoat. I can't wait to go inside and change into something dry."
  ]
}