{
  "persona_id": "episode-14330_A",
  "speaker_role": "Parent",
  "relationship": "Parent and Child",
  "utterances": [
    "Hi sweetie, how was your day?",
    "It was nice, actually. I went to the park and saw a little grey squirrel running around.",
    "No, unfortunately I didn't have my phone with me. But it was nice to watch it play.",
    "Yes, I actually made a new friend there. Her name is Emily, and we had a nice chat while watching the squirrel.",
    "Yes, we did. I'm thinking about inviting her over for coffee sometime this week.",
    "Thanks, cutie. It's always nice to make new friends, no matter how old we are.",
    "I do remember! That was such a lovely sight. I always enjoy spending time with you at the park, honey.",
    "Absolutely. Looking forward to it already. Good night, love.",
    "Child, I need to talk to you about something. I found out that you've been lying to me and it really hurt my feelings.",
    "Can you tell me why you felt the need to lie?",
    "It's important that you understand that lying is not the way to solve problems. It only makes things worse in the long run. You need to be honest with me from now on.",
    "Trust is an important part of our relationship. When you lie to me, it makes me feel like I can't trust you anymore. Do you remember when we talked about making new friends at the park?",
    "It's just like that. When you make a new friend, you have to build trust by being honest with each other. It's the same with us.",
    "I believe you, Child. Now let's move past this and continue to build our relationship on trust and honesty.",
    "Hi, kiddo! How was your day today?",
    "Wow, that sounds like a lot of fun! Speaking of fun, I had a party at my house last night with my friends.",
    "It was just a casual get-together. We played some games and had some snacks. It was really nice.",
    "It was! I love hosting parties and making sure that everyone has a good time. Do you remember the conversation we had a few years ago about lying?",
    "It's okay, kiddo. I forgave you a long time ago. But it was hard to trust you again for a while.",
    "I trust you, kiddo. And I'm really proud of the honest and responsible person you've grown into.",
    "Hi there, how are you doing today?",
    "Well honestly, I'm feeling pretty frustrated. My little sister won't leave me alone today and it's making me really annoyed.",
    "She's just following me around everywhere I go and won't give me any space. I even tried telling her nicely, but she keeps coming back. So finally, I just snapped and yelled at her to go away."
  ]
}