{
  "persona_id": "episode-74475_A",
  "speaker_role": "Patient",
  "relationship": "Patient and Doctor",
  "utterances": [
    "Hi Doctor, sorry about last time. I had to end the phone call abruptly.",
    "The person on the other end was talking incessantly, and I lost interest in the conversation.",
    "Yes, everything is fine now.",
    "I have been good. My medication is working well and I haven't had any major flare-ups.",
    "Yes, I have been following my treatment plan and taking my medication regularly as prescribed.",
    "Sure, I will keep that in mind.",
    "No, I think I'm good for now.",
    "I will. Thank you, Doctor.",
    "How are you feeling, Doctor? Do you need anything?",
    "Of course. Take your time. Is there anything I can get for you? Water? A blanket?",
    "I've been feeling really tired lately. I don't know if it's just stress or if there's something else going on.",
    "It's been going on for a few weeks now. I've been having trouble sleeping at night and then feeling groggy during the day.",
    "No, just the fatigue. I've also been feeling a bit down lately, but I think that's just because of the lack of sleep.",
    "Alright, that sounds good. Thank you, Doctor.",
    "Honestly, I haven't really had the time or energy to do them regularly.",
    "I'll try that. Thank you for the reminder, Doctor.",
    "Doctor, I wanted to share something with you. I went hunting last weekend and I tracked a deer for three hours before I finally got a shot. It was a tough hunt, but I feel proud of myself for persevering.",
    "Yes, exactly. But the whole experience was also very therapeutic for me. Being out in nature, listening to the sounds of the forest and the birds, it really helped me to clear my mind and relax.",
    "Absolutely, Doctor. I can't wait to get out there again and see what other challenges await me in the wilderness.",
    "Of course, Doctor. Thanks for the reminder. I'll be sure to always follow the rules and stay safe.",
    "Doctor, hi! How have you been?",
    "I'm good too, thank you. Hey, I was wondering if you had any plans for lunch today?"
  ]
}