{
  "persona_id": "episode-5289_A",
  "samples": [
    {
      "session": 1,
      "text": " This is nice. Just sitting here watching TV.\nYou know, sometimes I feel like I always have to be doing something. It's nice to just do nothing for a change.\nExactly. It's nice to have a break.\nThat's a great idea. We could even have a movie night or something.\nAnd you don't have to worry about me drinking too much and being obnoxious.\nYeah, and I don't have to worry about being hungover in the morning.\nAgreed. Let's make it a date.",
      "relationship": "Husband and Wife"
    },
    {
      "session": 2,
      "text": "Hey, babe, do you want anything? Water, maybe?\nOkay. So, I was thinking the other day...remember when I made you spaghetti with meatballs?\nI'm glad you liked it. In fact, I had so much fun cooking for you that I want to cook more often.\nYeah. And I was thinking, since I got spaghetti right, maybe I can try making your favorite dessert next time.\nNo problem. I just want to make you happy.\nAww, shucks.\nAnd I'm lucky to have you too. Remember when we went on that romantic vacation to Italy a couple of years ago? We had the best tiramisu ever.\nMaybe we should go back there someday.\nMe too. And until then, I'll try my best to make you happy with my cooking.",
      "relationship": "Husband and Wife"
    },
    {
      "session": 3,
      "text": "Can you believe what happened at the museum today? I saw this sculpture of a woman and then this lady just destroyed it.\nShe said it was because she thought it was ugly.\nYeah, I agree. It made me angry just watching it. But it also got me thinking about how subjective art can be. What one person finds beautiful, another might find ugly.\nAnd that's why I'm trying to expand my cooking skills to make more things you love, like that tiramisu I made last week.\nAgreed. The world would be a boring place if everyone liked the same things.",
      "relationship": "Husband and Wife"
    },
    {
      "session": 4,
      "text": "I'm glad you're feeling relaxed tonight. Do you want me to put on something else other than the news?\nMe too. Remember that meal I made you with the spaghetti and meatballs a couple of years ago?\nWell, I was thinking of trying to make your favorite dessert, tiramisu, sometime soon. What do you think?\nGreat, I'll make sure to get all the ingredients and set aside some time to make it for you.\nOf course, I always enjoy doing things for you. Speaking of which, is there anything you want to talk about or share with me?\nSure, go ahead and tell me about it. You know I always listen to your stories.\nThat sounds like a really interesting read. Maybe after you're done with it, I can borrow it from you.\nOf course, your insights are important to me. And it's important that we both feel heard and respected in our relationship.\nYes, I do remember. You were understandably upset because you thought it was ugly.\nI understand what you're saying. But I also want you to know that I support you and your emotions, even if you don't always handle them perfectly. We're all human and we make mistakes.\nAnd I'm grateful to have you as mine.",
      "relationship": "Husband and Wife"
    },
    {
      "session": 5,
      "text": "I really don't miss partying anymore.\nYeah, I feel like I have more control over my life. Plus, I don't have to deal with hangovers anymore.\nYou know what would make you happy? If I made you more meals.\nI want to. And I want to try making your favorite dessert, tiramisu.\nNo, I don't think so.\n(laughs) That's not very nice. But I understand why you felt that way.\nOf course, your stories are always interesting. And your opinions matter to me.\nI'm glad I can be there for you. Speaking of support, how's work going?",
      "relationship": "Husband and Wife"
    }
  ]
}