{
  "persona_id": "episode-36796_A",
  "speaker_role": "Patient",
  "relationship": "Patient and Doctor",
  "utterances": [
    "Doctor, I'm feeling really stressed because I have to attend a conference for work. I've never been to one before and I don't want to make any mistakes.",
    "Yes, that's exactly how I feel. I'm not sure what to expect.",
    "That's a good point. I'll make a checklist and make sure I have everything I need.",
    "That's reassuring. I'll definitely keep that in mind.",
    "Thank you, doctor. Those are all great tips. I feel a lot better now, knowing that I have a plan.",
    "Doctor, I must admit something that's been bothering me lately.",
    "During our last few sessions, I stopped looking at you. It's nothing personal, but I was trying to avoid temptation. I didn't want to be tempted by your good looks and charming personality.",
    "I know, and I didn't want to jeopardize our progress by letting my attraction get in the way.",
    "It's not just one thing, but rather a combination of factors. You're intelligent, caring, and confident, which are all attractive qualities. But I know that we can have a successful therapeutic relationship without crossing any inappropriate lines.",
    "Actually, there is. I feel stressed because I have to attend a conference next week, and I've never been to one before. I want to make a good impression, but I'm not sure what to expect.",
    "Doctor, I've been feeling guilty lately. I started two more wars, and now I feel like I've done something wrong.",
    "Well, I thought they were necessary at the time. But now, looking back, I realize they weren't the best solution.",
    "I decided to end both of the wars. I want to try and make things right.",
    "It's just that I can't shake this feeling of guilt. I feel like I've let people down.",
    "Thank you, Doctor. I just needed to talk this out with someone.",
    "Well, I've been avoiding looking at you during our sessions. It's not because of anything you did; I just don't want to be tempted by your good looks and charming personality.",
    "No, it's not your fault. I'll try to work on it myself.",
    "Doctor, I feel so lonely since my best friend passed away. I don't know how to cope with this.",
    "No, not really. I just spend most of my time alone in my room, thinking about him.",
    "I haven't really thought about that. Do you think it would help?",
    "That sounds like it could help. I just miss my friend so much and it feels like I'll never be able to fill the void he left in my life.",
    "That gives me hope. Thank you, Doctor."
  ]
}