{
  "persona_id": "episode-38144_A",
  "speaker_role": "Neighbors",
  "relationship": "Neighbors",
  "utterances": [
    "Hi, sorry I missed your call earlier. I was in a meeting and couldn't answer.",
    "I'm doing alright, thanks for asking. How about you?",
    "Yeah, I know how that feels. Speaking of work, did you ever hear back from that job you applied for?",
    "Definitely! I'll keep my fingers crossed for you too. But anyways, I'm just glad we finally caught up. It's been a while since we've had a chance to chat.",
    "Yes, that would be great. Let's make plans for next week. I'll text you so we can figure out a time and place.",
    "Hey, sorry I missed your call the other day. It was really busy at work.",
    "Things are good, just trying to stay focused on work and staying busy. Trying not to think about certain things.",
    "Oh, just some past relationships that I want to forget about. You know how it is.",
    "Exactly. It's been a struggle, but I'm trying to stay positive and keep moving forward.",
    "Actually, I have. I'm thinking about taking a trip somewhere soon.",
    "I haven't decided yet, but maybe somewhere I've never been before. It would be nice to have a change of scenery.",
    "Thanks, I think I will. It's good to have something to look forward to.",
    "I appreciate that, thank you. It's good to know I have someone to count on.",
    "Hey, Neighbor B! How are you doing?",
    "I'm feeling pretty excited actually. I just quit my club and I'm starting my own.",
    "Well, I just felt like I could do better. I have a lot of experience and I know what it takes to run a successful club.",
    "It's going to be a fitness club. I'm really passionate about health and wellness, and I want to create a space where people can come and work towards their goals.",
    "Yes, I've been working on it for a while now. I have a business plan and I've already started scouting out locations.",
    "Thanks, I really appreciate your support.",
    "Definitely. It's a big step, but I'm ready for the challenge."
  ]
}