{
  "persona_id": "episode-98323_A",
  "speaker_role": "Classmates",
  "relationship": "Classmates",
  "utterances": [
    "I found a really good book yesterday, but I threw it away by mistake. Now I feel so sad.",
    "It was a mystery novel that I had been wanting to read for so long.",
    "I went back to where I threw it away, but it was already gone. Someone must have picked it up.",
    "That's a good idea! I will try that. Thank you.",
    "Yeah, ever since I was little, books have been my escape from reality.",
    "Haha, yeah. I still do that sometimes. But now I also appreciate how much books can teach us too.",
    "And that's why I feel like I lost a part of myself when I lost that book.",
    "I don't know what to do. I can't tell him how I feel.",
    "You know who. I can't tell him that I love him.",
    "No, it's not that. I'm just scared of his response. What if he doesn't feel the same way?",
    "I know, but I don't want to ruin our friendship. What if it becomes awkward between us?",
    "Yeah, I guess that's a good idea. And who knows, maybe he feels the same way about me.",
    "Yeah, I remember. That's completely unrelated though.",
    "You're right. I'll try to gather the courage to tell him how I feel.",
    ", I saw your mother crying in the park today. Is everything okay?",
    "She seemed really upset, but I stayed with her for a while and talked to her. She didn't want to talk about what was wrong, though.",
    "Do you want me to come with you, or is it something you want to handle on your own?",
    "Of course,. We're friends, and that's what friends do for each other.",
    "Hey, speaking of being friends and being there for each other, there's something I've been wanting to tell you. A couple of years ago, I realized that I have feelings for you, but I've been too scared to say anything because I didn't want to ruin our friendship.",
    "Thanks, it's been weighing on me for a while. But it's okay if you don't feel the same way, I just wanted to be honest with you."
  ]
}