{
  "persona_id": "episode-51953_A",
  "speaker_role": "Neighbors",
  "relationship": "Neighbors",
  "utterances": [
    "Well, I want to buy a new car that is more fuel-efficient. The gas prices are going up, and my current car is not very friendly on my wallet.",
    "I'm thinking of buying a hybrid car. I researched and found that they have excellent fuel efficiency and lower maintenance costs.",
    "Yes, I have. But I'm also planning to sell my current car, which can cover a significant portion of the cost.",
    "Exactly. That's why I think it's a smart investment. What do you think?",
    "That's another reason why I'm considering buying a hybrid car. It's good for the environment, and I'll be doing my part to reduce my carbon footprint.",
    "Thanks a lot, B. I'm excited to start this new chapter with a more efficient and eco-friendly car.",
    "I'm about to perform on stage tonight and I'm so nervous!",
    "I Will Always Love You\" by Whitney Houston.",
    "Thanks, I hope so. I've never been this nervous before.",
    "Just talking to you is already making me feel better.",
    "Thank you. I just have to remember to take deep breaths and focus on the music.",
    "Actually, I did. I found a hybrid that gets great gas mileage and has low maintenance costs.",
    "I would love that! But first, I have to get through tonight's performance. Wish me luck!",
    "Hi there, how are you doing?",
    "I'm a bit tired, to be honest, but I feel good. I was up late last night talking with Taylor.",
    "She's had a bit of a rough time lately. Her boyfriend broke up with her, and she's been feeling pretty down about it.",
    "Yeah, we talked for a while. I just tried to be there for her and listen to what she had to say. I hugged her and told her that everything would be alright.",
    "She did. She thanked me for being there for her, and I think it really helped her to know that she had someone to talk to.",
    "Absolutely. And it reminds me of when I was performing on stage a few years ago. I was so nervous, but you were there to support me.",
    "I hope so. I just want to be there for her and help her get through this tough time."
  ]
}